print("复杂数据类型——表")

--声明表，索引从1开始
--其他任何复杂的数据结构都是由表构成的
a = {1, 2, 3}
b = {1, "ss", nil, 234}


for i = 1, #a do
	print(a[i])
end

--[[
	#获取长度关键字
	表中最后一个元素为nil，计算长度时忽略
	其他位置不影响
]]
c = {1, 2, 3, 4, 5, nil}
print("c size:" .. #c)
d = {nil, nil, 2, 3, 4, 5}
print("d size:" .. #d)

--二维数组
e = {{1, 2, 3}, {4, 5, 6}}
--二维数组的遍历
for i = 1, #e do
	for j = 1, #e[i] do
		print(e[i][j])
	end
end

--自定义索引, 可以自定义出原本不合法的下标
--忽略自定义下标<=0的元素，起始下标1从剩下的元素开始计算
f = {[-1] = -1, [0] = 0, 1, 2, 3}
print(f[-1])
--计算标长度时，会忽略<=0的下标
print(#f)
g = {[1] = 1, [2] = 2, [4] = 4, 5}
h = {1, [2] = 2, [4] = 4}
--如果
print(#g)
print(#h)
